In [2]:
import pandas as pd
import os
Fname = input('Please enter in the filename')
df = pd.read_csv(Fname)
df

         0  2017-04-09 17:20:09  10323  33.79
0        1  2018-08-04 22:47:48  10081  32.82
1        2  2017-07-25 18:44:21  10203  54.88
2        3  2018-05-28 01:47:21  10376  56.67
3        4  2016-01-23 12:25:38  10482  48.82
4        5  2018-11-18 18:23:46  10444  34.13
...    ...                  ...    ...    ...
9994  9995  2016-03-06 12:05:14  10087  25.62
9995  9996  2016-07-12 23:48:31  10243  54.00
9996  9997  2019-08-05 10:18:02  10258  45.59
9997  9998  2017-05-26 23:53:53  10447  21.88
9998  9999  2017-06-05 16:56:05  10365  39.79

[9999 rows x 4 columns]

In [3]:
path = 'D:\IntroCSE\Challenge 1/'
df = pd.read_csv(path + 'transactions_medium.csv', sep=',', names=['record_id', 'date', 'user_id', 'amount'])
df

        record_id                 date  user_id  amount
0               0  2019-03-28 08:06:32    10642   60.29
1               1  2018-06-07 09:47:54    11141   36.71
2               2  2019-06-09 19:14:19    10120   19.92
3               3  2019-05-24 23:23:58    10714  -12.52
4               4  2018-09-10 05:42:41    10888   53.80
...           ...                  ...      ...     ...
999995     999995  2016-05-14 01:12:32    10703   43.46
999996     999996  2018-01-02 09:59:13    11152   19.89
999997     999997  2018-11-16 20:25:28    10037   29.45
999998     999998  2018-10-20 10:51:54    11358   41.11
999999     999999  2020-01-27 16:44:09    10154   43.97

[1000000 rows x 4 columns]

In [4]:
import time
class Timer(object):
    def __init__(self):
        self.times = []
        self.start()

    def start(self):
        self.start_time = time.time()

    def stop(self):
        self.times.append(time.time() - self.start_time)
        return self.times[-1]

In [5]:
timer = Timer()
df['Month'] = df['date'].str.slice(start= 5, stop=7, step= 1)
print(df.head(10))
print('Time to exec mean_func %.5f sec:' % timer.stop())

   record_id                 date  user_id  amount Month
0          0  2019-03-28 08:06:32    10642   60.29    03
1          1  2018-06-07 09:47:54    11141   36.71    06
2          2  2019-06-09 19:14:19    10120   19.92    06
3          3  2019-05-24 23:23:58    10714  -12.52    05
4          4  2018-09-10 05:42:41    10888   53.80    09
5          5  2018-07-26 14:53:36    10768    9.43    07
6          6  2017-04-30 19:37:08    10427   59.11    04
7          7  2020-01-19 13:28:40    10085    5.17    01
8          8  2018-07-11 09:31:32    10592    3.64    07
9          9  2019-03-30 18:19:10    11187   19.41    03
Time to exec mean_func 0.38102 sec:

In [6]:
timer = Timer()
print('Time to exec mean_func %.5f sec:' % timer.stop())
df.groupby('Month')['amount'].mean()

Time to exec mean_func 0.00000 sec:

Month
01    29.963394
02    29.986668
03    30.016803
04    29.992362
05    29.941243
06    29.866906
07    29.961660
08    29.911676
09    29.978576
10    29.810988
11    29.992510
12    29.897908
Name: amount, dtype: float64

In [7]:
timer = Timer()
transaction_value = df.groupby('Month')['amount'].mean()
result1 = transaction_value.max()
r1 = df.groupby('Month')['amount'].mean()
rp1 = pd.Series(r1, dtype=('float32'))

for month, sales1 in transaction_value.items():
    if sales1 == result1:
        print(f'Month is {month} with the maximum transaction value is {result1}')

print('Time to exec mean_func %.5f sec:' % timer.stop())

Month is 03 with the maximum transaction value is 30.016803343853134
Time to exec mean_func 0.15678 sec:

In [8]:
timer = Timer()
result2 = transaction_value.min()
r2= df.groupby('Month')['amount'].mean()
rp2 = pd.Series(r2, dtype=('float32'))

for month, sales2 in transaction_value.items():
    if sales2 == result2:
        print(f'Month is {month} with the minimum transaction value is {result2}')

print('Time to exec mean_func %.5f sec:' % timer.stop())

Month is 10 with the minimum transaction value is 29.810987769896645
Time to exec mean_func 0.10848 sec: